Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType
Defines text label visualization types for diagram settings of analysis display style.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType.ShowPredefined
Show diagram text label only for points that have flag ValueAtPointFlags::DisplayText

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType.ShowNone
Don't show diagram text labels

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType.ShowAll
Show diagram text label for each point